<a href="https://colab.research.google.com/github/Abdelrhman410/DB/blob/main/Untitled1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Case-study: Salaries EDA

Import Pandas as pd

In [13]:
import pandas as pd

Read Salaries.csv as dataframe

In [14]:
df = pd.read_csv("https://raw.githubusercontent.com/Abdelrhman410/IMDB-Analysis/main/Salaries2.csv")

/usr/local/lib/python3.8/dist-packages/IPython/core/interactiveshell.py:3326: DtypeWarning: Columns (12) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

Check the head of the dataframe

In [15]:
df.head(3)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN

Use the .info(method to find out how many entries there are

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148650 entries, 0 to 148649
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148650 non-null  int64
 1   EmployeeName      148650 non-null  object
 2   JobTitle          148650 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148650 non-null  float64
 8   TotalPayBenefits  148650 non-null  float64
 9   Year              148650 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148650 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(7), int64(2), object(4)
memory usage: 14.7+ MB

In [17]:
df.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes
count,148650.000000,148045.000000,148650.000000,148650.000000,112491.000000,148650.000000,148650.000000,148650.000000,0.0
mean,74325.500047,66325.448840,5066.059886,3648.767297,25007.893151,74770.333901,93695.075969,2012.522603,NaN
std,42911.703176,42764.635495,11454.380559,8056.601866,15402.215858,50516.196009,62792.497391,1.117526,NaN
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN
25%,37163.250000,33588.200000,0.000000,0.000000,11535.395000,36169.955000,44073.337500,2012.000000,NaN
50%,74325.500000,65007.450000,0.000000,811.270000,28628.620000,71427.240000,92406.020000,2013.000000,NaN
75%,111487.750000,94691.050000,4658.175000,4236.065000,35566.855000,105842.960000,132877.992500,2014.000000,NaN
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN

What is the avarge BasePay?

In [19]:
df["BasePay"].mean()

66325.4488404877



---

What is the highest amount of OvertimePay in the dataset

In [21]:
df["OvertimePay"].max()

245131.88



---

What is the job title of JOSEPH DRISCOLL? Note : Use all caps, otherwise you may get an answer that doesn't match up(there is also the lowercase Joseph Driscoll).

In [24]:
df[df["EmployeeName"] == "JOSEPH DRISCOLL"]["JobTitle"]

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object



---

How much does JOSEPH DRISCOLL make (including benefits)?

In [26]:
df[df["EmployeeName"] == "JOSEPH DRISCOLL"]["TotalPayBenefits"]

24    270324.91
Name: TotalPayBenefits, dtype: float64



---

What is the name of highest paid person (including benefits)?

In [27]:
df["TotalPayBenefits"].max()

567595.43

In [29]:
df[df["TotalPayBenefits"] == df["TotalPayBenefits"].max()]["EmployeeName"]

0    NATHANIEL FORD
Name: EmployeeName, dtype: object



---

What is the name of lowest paid person (including benefits)?

In [32]:
df[df["TotalPayBenefits"] == df["TotalPayBenefits"].min()]["EmployeeName"]

148649    Joe Lopez
Name: EmployeeName, dtype: object



---

What is the average BasePay of all employees per year (2011-2014)?